&НаКлиенте
Процедура ЗаполнитьРегламентныеРаботы(Команда)
	ЗаполнитьРегламентныеРаботыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегламентныеРаботыНаСервере()
	мхМеханикиСервер.ЗаполнитьРегламентныеРаботы(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеРаботы(Команда)
	ОтметитьВсеРаботыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеРаботыНаСервере()
	Для Каждого СтрокаРабота Из Объект.мхРаботы Цикл
		СтрокаРабота.мхВыполнено = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПолучение(Команда)
	ПодтвердитьПолучениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьПолучениеНаСервере()
	Для Каждого СтрокаТовар Из Объект.мхТовары Цикл
		СтрокаТовар.мхПолученоНаСкладе = Истина;
		СтрокаТовар.мхКоличествоПринятоНаСкладе = СтрокаТовар.мхКоличество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧекЛист(Команда)
	ЗаполнитьЧекЛистНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧекЛистНаСервере()
	мхМеханикиСервер.ЗаполнитьЧекЛистПоШаблону(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФото(Команда)
	ЗаполнитьФотоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФотоНаСервере()
	мхМеханикиСервер.ЗаполнитьСоставФотоОсмотра(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗН(Команда)
	ЗакрытьЗННаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЗННаСервере()
	ТекстОшибки = "";
	Объект.мхСтатус = Перечисления.мхСтатусыЗН.Закрыт;
	Если НЕ мхМеханикиСервер.ПроверитьГотовностьКЗакрытию(Объект, ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	Записать();
КонецПроцедуры
