&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНовыеИзменено(Элемент)
	ОбновитьОтборНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборНаСервере()
	ОбновитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтбор()
	Список.Отбор.Элементы.Очистить();
	Если ТолькоНовые Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("мхСтатус");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.мхСтатусыЗН.План;
	КонецЕсли;
КонецПроцедуры
