&НаКлиенте
Процедура МоиЗаявки(Команда)
	ОткрытьФорму("Документ.мхЗаказНаряд.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Календарь(Команда)
	ОткрытьФорму("ОбщаяФорма.мхКалендарь");
КонецПроцедуры

&НаКлиенте
Процедура Отчёт(Команда)
	ОткрытьФорму("Отчет.мхОтработанныеНормочасы.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ТехЛитература(Команда)
	ОткрытьФорму("ОбщаяФорма.мхТехЛитература");
КонецПроцедуры

&НаКлиенте
Процедура Профиль(Команда)
	ОткрытьФорму("ОбщаяФорма.мхПрофиль");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьБиблиотеку(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("https://nexcloud.istk.ru");
КонецПроцедуры
