&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ДатаЗаявок) Тогда
		ДатаЗаявок = ТекущаяДатаСеанса();
	КонецЕсли;
	ЗаполнитьЗаявкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзменена(Элемент)
	ЗаполнитьЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявкиНаСервере()
	ЗаявкиНаДату.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Д.Ссылка КАК Ссылка,
	|	Д.Номер КАК Номер,
	|	Д.мхСтатус КАК Статус,
	|	Д.мхТехника КАК Техника,
	|	Д.мхЗаказчик КАК Заказчик
	|ИЗ
	|	Документ.мхЗаказНаряд КАК Д
	|ГДЕ
	|	Д.Дата >= &НачалоДня И Д.Дата <= &КонецДня
	|УПОРЯДОЧИТЬ ПО
	|	Д.Дата";
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаЗаявок));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаЗаявок));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЗаявкиНаДату.Добавить();
		НоваяСтрока.Ссылка = Выборка.Ссылка;
		НоваяСтрока.Номер = Выборка.Номер;
		НоваяСтрока.Статус = Выборка.Статус;
		НоваяСтрока.Техника = Выборка.Техника;
		НоваяСтрока.Заказчик = Выборка.Заказчик;
	КонецЦикла;
КонецПроцедуры
